testedt/src/Documents/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Затраты</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <tabularSections>
    <name>СписокПроектов</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

testedt/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

testedt/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Агенты</name>
        <description>Агенты</description>
        <code>02.05</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

testedt/src/Documents/Затраты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Управленческий.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗатратыСписокПроектов.Проект КАК Проект,
		|	СУММА(ЗатратыСписокПроектов.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Затраты.СписокПроектов КАК ЗатратыСписокПроектов
		|ГДЕ
		|	ЗатратыСписокПроектов.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗатратыСписокПроектов.Проект";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Управленческий.ПрибылиУбытки;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Проекты] = Выборка.Проект;
		Движение.СчетКт = ПланыСчетов.Управленческий.ОбщехозяйственныеЗатраты;
		Движение.Сумма = Выборка.Сумма;
	КонецЦикла;
	
КонецПроцедуры
